modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr8258.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MSPI</name>
      <description>Auto-generated from section 'mspi'</description>
      <baseAddress>0x80000c</baseAddress>
      <registers>
        <register>
          <name>MSPI_DATA</name>
          <description>Auto-generated from mspi_data</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>MSPI_CTRL</name>
          <description>Auto-generated from mspi_ctrl</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_MSPI_CS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MSPI_SDO</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MSPI_CONT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MSPI_RD</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MSPI_BUSY</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPI_MODE</name>
          <description>Auto-generated from mspi_mode</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_MSPI_DUAL_DATA_MODE_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MSPI_DUAL_ADDR_MODE_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_MSPI_CLK_DIV</name>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RESET</name>
      <description>Auto-generated from section 'reset'</description>
      <baseAddress>0x800060</baseAddress>
      <registers>
        <register>
          <name>RST0</name>
          <description>Auto-generated from rst0</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RST0_SPI</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST0_I2C</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST0_UART</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST0_USB</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST0_PWM</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST0_QDEC</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST0_SWIRE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RST1</name>
          <description>Auto-generated from rst1</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RST1_ZB</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST1_SYS_TIMER</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST1_DMA</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST1_ALGM</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST1_AES</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST1_ADC</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST1_ALG</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RST2</name>
          <description>Auto-generated from rst2</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RST2_AIF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST2_AUD</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST2_DFIFO</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST2_RISC</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST2_MCIC</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST2_RISC1</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RST2_MCIC1</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_EN0</name>
          <description>Auto-generated from clk_en0</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_CLK0_SPI_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK0_I2C_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK0_UART_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK0_USB_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK0_PWM_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK0_QDEC_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK0_SWIRE_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_EN1</name>
          <description>Auto-generated from clk_en1</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_CLK1_ZB_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK1_SYS_TIMER_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK1_DMA_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK1_ALGM_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK1_AES_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_EN2</name>
          <description>Auto-generated from clk_en2</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_CLK2_AIF_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK2_AUD_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK2_DFIFO_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK2_MC_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK2_MCIC_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_SEL</name>
          <description>Auto-generated from clk_sel</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_SCLK_DIV</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>FLD_SCLK_SEL</name>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_SCLK_HS_SEL</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S_STEP</name>
          <description>Auto-generated from i2s_step</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_I2S_STEP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>FLD_I2S_CLK_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S_MOD</name>
          <description>Auto-generated from i2s_mod</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMIC_STEP</name>
          <description>Auto-generated from dmic_step</description>
          <addressOffset>0xc</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_DMIC_STEP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>FLD_DMIC_CLK_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMIC_MOD</name>
          <description>Auto-generated from dmic_mod</description>
          <addressOffset>0xd</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>WAKEUP_EN</name>
          <description>Auto-generated from wakeup_en</description>
          <addressOffset>0xe</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_WAKEUP_SRC_I2C</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_WAKEUP_SRC_SPI</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_WAKEUP_SRC_USB</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_WAKEUP_SRC_GPIO</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_WAKEUP_SRC_I2C_SYN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_WAKEUP_SRC_GPIO_RM</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_WAKEUP_SRC_USB_RESM</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_WAKEUP_SRC_RST_SYS</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWDN_CTRL</name>
          <description>Auto-generated from pwdn_ctrl</description>
          <addressOffset>0xf</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_PWDN_CTRL_REBOOT</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PWDN_CTRL_SLEEP</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MCU_WAKEUP_MASK</name>
          <description>Auto-generated from mcu_wakeup_mask</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
        </register>
