modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr8258.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>_7816</name>
      <description>Auto-generated from section '7816'</description>
      <baseAddress>0x80007b</baseAddress>
      <registers>
        <register>
          <name>_7816_CLK_DIV</name>
          <description>Auto-generated from _7816_clk_div</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>UART</name>
      <description>Auto-generated from section 'uart'</description>
      <baseAddress>0x800090</baseAddress>
      <registers>
        <register>
          <name>UART_DATA_BUF0</name>
          <description>Auto-generated from uart_data_buf0</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>UART_DATA_BUF1</name>
          <description>Auto-generated from uart_data_buf1</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>UART_DATA_BUF2</name>
          <description>Auto-generated from uart_data_buf2</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>UART_DATA_BUF3</name>
          <description>Auto-generated from uart_data_buf3</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>UART_CLK_DIV</name>
          <description>Auto-generated from uart_clk_div</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_UART_CLK_DIV</name>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CLK_DIV_EN</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_CTRL0</name>
          <description>Auto-generated from uart_ctrl0</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_UART_BPWC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_UART_RX_DMA_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_TX_DMA_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_RX_IRQ_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_TX_IRQ_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_CTRL1</name>
          <description>Auto-generated from uart_ctrl1</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_UART_CTRL1_CTS_SELECT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CTRL1_CTS_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CTRL1_PARITY_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CTRL1_PARITY_POLARITY</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CTRL1_STOP_BIT</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CTRL1_TTL</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CTRL1_LOOPBACK</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_CTRL2</name>
          <description>Auto-generated from uart_ctrl2</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_UART_CTRL2_RTS_TRIG_LVL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CTRL2_RTS_PARITY</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CTRL2_RTS_MANUAL_VAL</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CTRL2_RTS_MANUAL_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CTRL2_RTS_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CTRL3_RX_IRQ_TRIG_LEVEL</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CTRL3_TX_IRQ_TRIG_LEVEL</name>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_CTRL3</name>
          <description>Auto-generated from uart_ctrl3</description>
          <addressOffset>0x9</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_UART_RX_IRQ_TRIG_LEV</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_UART_TX_IRQ_TRIG_LEV</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_RX_TIMEOUT0</name>
          <description>Auto-generated from uart_rx_timeout0</description>
          <addressOffset>0xa</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_UART_TIMEOUT_BW</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_RX_TIMEOUT1</name>
          <description>Auto-generated from uart_rx_timeout1</description>
          <addressOffset>0xb</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_UART_TIMEOUT_MUL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_UART_P7816_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_MASK_TXDONE_IRQ</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_MASK_ERR_IRQ</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_BUF_CNT</name>
          <description>Auto-generated from uart_buf_cnt</description>
          <addressOffset>0xc</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_UART_RX_BUF_CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_UART_TX_BUF_CNT</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_STATUS0</name>
          <description>Auto-generated from uart_status0</description>
          <addressOffset>0xd</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_UART_RBCNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FLD_UART_IRQ_FLAG</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_WBCNT</name>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FLD_UART_CLEAR_RX_FLAG</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_RX_ERR_FLAG</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_STATUS1</name>
          <description>Auto-generated from uart_status1</description>
          <addressOffset>0xe</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_UART_TX_DONE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_TX_BUF_IRQ</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_RX_DONE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_UART_RX_BUF_IRQ</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_STATE</name>
          <description>Auto-generated from uart_state</description>
          <addressOffset>0xf</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_UART_TSTATE_I</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FLD_UART_RSTATE_I</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
