modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr8258.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USB</name>
      <description>Auto-generated from section 'usb'</description>
      <baseAddress>0x800100</baseAddress>
      <registers>
        <register>
          <name>CTRL_EP_PTR</name>
          <description>Auto-generated from ctrl_ep_ptr</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>CTRL_EP_DAT</name>
          <description>Auto-generated from ctrl_ep_dat</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>CTRL_EP_CTRL</name>
          <description>Auto-generated from ctrl_ep_ctrl</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_EP_DAT_ACK</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_EP_DAT_STALL</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_EP_STA_ACK</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_EP_STA_STALL</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_EP_IRQ_STA</name>
          <description>Auto-generated from ctrl_ep_irq_sta</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_CTRL_EP_IRQ_TRANS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_IRQ_SETUP</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_IRQ_DATA</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_IRQ_STA</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_IRQ_INTF</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_EP_IRQ_MODE</name>
          <description>Auto-generated from ctrl_ep_irq_mode</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_CTRL_EP_AUTO_ADDR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_AUTO_CFG</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_AUTO_INTF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_AUTO_STA</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_AUTO_SYN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_AUTO_DESC</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_AUTO_FEAT</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CTRL_EP_AUTO_STD</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CTRL</name>
          <description>Auto-generated from usb_ctrl</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_USB_CTRL_AUTO_CLK</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_CTRL_LOW_SPD</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_CTRL_LOW_JITT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_CTRL_TST_MODE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CYC_CALI</name>
          <description>Auto-generated from usb_cyc_cali</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>USB_MDEV</name>
          <description>Auto-generated from usb_mdev</description>
          <addressOffset>0xa</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_HOST_CONN</name>
          <description>Auto-generated from usb_host_conn</description>
          <addressOffset>0xb</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_USB_MDEV_SELF_PWR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_MDEV_SUSP_STA</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_SUPS_CYC_CALI</name>
          <description>Auto-generated from usb_sups_cyc_cali</description>
          <addressOffset>0xc</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_INTF_ALT</name>
          <description>Auto-generated from usb_intf_alt</description>
          <addressOffset>0xd</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP8123_PTR</name>
          <description>Auto-generated from usb_ep8123_ptr; aliases: USB_EP8_PTR</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>USB_EP1_PTR</name>
          <description>Auto-generated from usb_ep1_ptr</description>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP2_PTR</name>
          <description>Auto-generated from usb_ep2_ptr</description>
          <addressOffset>0x12</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP3_PTR</name>
          <description>Auto-generated from usb_ep3_ptr</description>
          <addressOffset>0x13</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP4567_PTR</name>
          <description>Auto-generated from usb_ep4567_ptr; aliases: USB_EP4_PTR</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>USB_EP5_PTR</name>
          <description>Auto-generated from usb_ep5_ptr</description>
          <addressOffset>0x15</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP6_PTR</name>
          <description>Auto-generated from usb_ep6_ptr</description>
          <addressOffset>0x16</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP7_PTR</name>
          <description>Auto-generated from usb_ep7_ptr</description>
          <addressOffset>0x17</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP8123_DAT</name>
          <description>Auto-generated from usb_ep8123_dat; aliases: USB_EP8_DAT</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>USB_EP1_DAT</name>
          <description>Auto-generated from usb_ep1_dat</description>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP2_DAT</name>
          <description>Auto-generated from usb_ep2_dat</description>
          <addressOffset>0x1a</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP3_DAT</name>
          <description>Auto-generated from usb_ep3_dat</description>
          <addressOffset>0x1b</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP4567_DAT</name>
          <description>Auto-generated from usb_ep4567_dat; aliases: USB_EP4_DAT</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>USB_EP5_DAT</name>
          <description>Auto-generated from usb_ep5_dat</description>
          <addressOffset>0x1d</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP6_DAT</name>
          <description>Auto-generated from usb_ep6_dat</description>
          <addressOffset>0x1e</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP7_DAT</name>
          <description>Auto-generated from usb_ep7_dat</description>
          <addressOffset>0x1f</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP8_CTRL</name>
          <description>Auto-generated from usb_ep8_ctrl</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP1_CTRL</name>
          <description>Auto-generated from usb_ep1_ctrl</description>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP2_CTRL</name>
          <description>Auto-generated from usb_ep2_ctrl</description>
          <addressOffset>0x22</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP3_CTRL</name>
          <description>Auto-generated from usb_ep3_ctrl</description>
          <addressOffset>0x23</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP4_CTRL</name>
          <description>Auto-generated from usb_ep4_ctrl</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP5_CTRL</name>
          <description>Auto-generated from usb_ep5_ctrl</description>
          <addressOffset>0x25</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP6_CTRL</name>
          <description>Auto-generated from usb_ep6_ctrl</description>
          <addressOffset>0x26</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP7_CTRL</name>
          <description>Auto-generated from usb_ep7_ctrl</description>
          <addressOffset>0x27</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_USB_EP_BUSY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EP_STALL</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EP_DAT0</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EP_DAT1</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EP_MONO</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EP_EOF_ISO</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_EP8123_BUF_ADDR</name>
          <description>Auto-generated from usb_ep8123_buf_addr; aliases: USB_EP8_BUF_ADDR</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>USB_EP1_BUF_ADDR</name>
          <description>Auto-generated from usb_ep1_buf_addr</description>
          <addressOffset>0x29</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP2_BUF_ADDR</name>
          <description>Auto-generated from usb_ep2_buf_addr</description>
          <addressOffset>0x2a</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP3_BUF_ADDR</name>
          <description>Auto-generated from usb_ep3_buf_addr</description>
          <addressOffset>0x2b</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP4567_BUF_ADDR</name>
          <description>Auto-generated from usb_ep4567_buf_addr; aliases: USB_EP4_BUF_ADDR</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>USB_EP5_BUF_ADDR</name>
          <description>Auto-generated from usb_ep5_buf_addr</description>
          <addressOffset>0x2d</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP6_BUF_ADDR</name>
          <description>Auto-generated from usb_ep6_buf_addr</description>
          <addressOffset>0x2e</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP7_BUF_ADDR</name>
          <description>Auto-generated from usb_ep7_buf_addr</description>
          <addressOffset>0x2f</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_RAM_CTRL</name>
          <description>Auto-generated from usb_ram_ctrl</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_USB_CEN_PWR_DN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_CLK_PWR_DN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_WEN_PWR_DN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_CEN_FUNC</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_ISO_MODE</name>
          <description>Auto-generated from usb_iso_mode</description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_IRQ</name>
          <description>Auto-generated from usb_irq</description>
          <addressOffset>0x39</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_MASK</name>
          <description>Auto-generated from usb_mask</description>
          <addressOffset>0x3a</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_USB_EDP8_IRQ</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EDP1_IRQ</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EDP2_IRQ</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EDP3_IRQ</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EDP4_IRQ</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EDP5_IRQ</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EDP6_IRQ</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_EDP7_IRQ</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_EP8_SEND_MAX</name>
          <description>Auto-generated from usb_ep8_send_max</description>
          <addressOffset>0x3b</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP8_SEND_THRES</name>
          <description>Auto-generated from usb_ep8_send_thres</description>
          <addressOffset>0x3c</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP8_FIFO_MODE</name>
          <description>Auto-generated from usb_ep8_fifo_mode</description>
          <addressOffset>0x3d</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>USB_EP_MAX_SIZE</name>
          <description>Auto-generated from usb_ep_max_size</description>
          <addressOffset>0x3e</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_USB_ENP8_FIFO_MODE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_USB_ENP8_FULL_FLAG</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ACC_LEN</name>
          <description>Auto-generated from rf_acc_len</description>
          <addressOffset>0x305</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RF_ACC_LEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FLD_RF_LR_MAN_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_LR_TX_SEL</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_BLE_LR</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_LR_ACC_TRIG</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_TIMESTAMP</name>
          <description>Auto-generated from rf_timestamp</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>USB_MIC_DAT0</name>
          <description>Auto-generated from usb_mic_dat0</description>
          <addressOffset>0x1700</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>USB_MIC_DAT1</name>
          <description>Auto-generated from usb_mic_dat1</description>
          <addressOffset>0x1702</addressOffset>
          <size>16</size>
        </register>
