modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr8258.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AES</name>
      <description>Auto-generated from section 'aes'</description>
      <baseAddress>0x800540</baseAddress>
      <registers>
        <register>
          <name>AES_CTRL</name>
          <description>Auto-generated from aes_ctrl</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AES_CTRL_CODEC_TRIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AES_CTRL_DATA_FEED</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AES_CTRL_CODEC_FINISHED</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_DATA</name>
          <description>Auto-generated from aes_data</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUDIO</name>
      <description>Auto-generated from section 'audio'</description>
      <baseAddress>0x800560</baseAddress>
      <registers>
        <register>
          <name>AUDIO_CTRL</name>
          <description>Auto-generated from audio_ctrl</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AUDIO_MONO_MODE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUDIO_I2S_PLAYER_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUDIO_SDM_PLAYER_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUDIO_ISO_PLAYER_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUDIO_I2S_RECORDER_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUDIO_I2S_INTERFACE_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUDIO_GRP_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUDIO_HPF_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_CTRL</name>
          <description>Auto-generated from pwm_ctrl</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_PWM_MULTIPLY2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PWM_ENABLE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_LINER_INTERPOLATE_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_LEFT_SHAPING_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RIGHT_SHAPING_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ASCL_TUNE</name>
          <description>Auto-generated from ascl_tune</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>PN1_LEFT</name>
          <description>Auto-generated from pn1_left</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PN1_LEFT_CHN_BITS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PN2_LEFT_CHN_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PN1_LEFT_CHN_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PN2_LEFT</name>
          <description>Auto-generated from pn2_left</description>
          <addressOffset>0x9</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PN2_LEFT_CHN_BITS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PN2_RIGHT_CHN_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PN1_RIGHT_CHN_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PN1_RIGHT</name>
          <description>Auto-generated from pn1_right</description>
          <addressOffset>0xa</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PN1_RIGHT_CHN_BITS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CLK2A_AUDIO_CLK_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXCHANGE_SDM_DATA_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PN2_RIGHT</name>
          <description>Auto-generated from pn2_right</description>
          <addressOffset>0xb</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PN2_RIGHT_CHN_BITS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SDM_LEFT_CHN_CONST_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDM_RIGHT_CHN_CONST_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
