modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr8258.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO</name>
      <description>Auto-generated from section 'gpio'</description>
      <baseAddress>0x800580</baseAddress>
      <registers>
        <register>
          <name>GPIO_PA_IN</name>
          <description>Auto-generated from gpio_pa_in; aliases: GPIO_PA_SETTING1</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>GPIO_PA_IE</name>
          <description>Auto-generated from gpio_pa_ie</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PA_OEN</name>
          <description>Auto-generated from gpio_pa_oen</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PA_OUT</name>
          <description>Auto-generated from gpio_pa_out</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PA_POL</name>
          <description>Auto-generated from gpio_pa_pol; aliases: GPIO_PA_SETTING2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>GPIO_PA_DS</name>
          <description>Auto-generated from gpio_pa_ds</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PA_GPIO</name>
          <description>Auto-generated from gpio_pa_gpio</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PA_IRQ_EN</name>
          <description>Auto-generated from gpio_pa_irq_en</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PB_IN</name>
          <description>Auto-generated from gpio_pb_in</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PB_OEN</name>
          <description>Auto-generated from gpio_pb_oen</description>
          <addressOffset>0xa</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PB_OUT</name>
          <description>Auto-generated from gpio_pb_out</description>
          <addressOffset>0xb</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PB_POL</name>
          <description>Auto-generated from gpio_pb_pol</description>
          <addressOffset>0xc</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PB_GPIO</name>
          <description>Auto-generated from gpio_pb_gpio</description>
          <addressOffset>0xe</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PB_IRQ_EN</name>
          <description>Auto-generated from gpio_pb_irq_en</description>
          <addressOffset>0xf</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PC_IN</name>
          <description>Auto-generated from gpio_pc_in</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PC_OEN</name>
          <description>Auto-generated from gpio_pc_oen</description>
          <addressOffset>0x12</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PC_OUT</name>
          <description>Auto-generated from gpio_pc_out</description>
          <addressOffset>0x13</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PC_POL</name>
          <description>Auto-generated from gpio_pc_pol</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PC_GPIO</name>
          <description>Auto-generated from gpio_pc_gpio</description>
          <addressOffset>0x16</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PC_IRQ_EN</name>
          <description>Auto-generated from gpio_pc_irq_en</description>
          <addressOffset>0x17</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PD_IN</name>
          <description>Auto-generated from gpio_pd_in; aliases: GPIO_PD_SETTING1</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>GPIO_PD_IE</name>
          <description>Auto-generated from gpio_pd_ie</description>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PD_OEN</name>
          <description>Auto-generated from gpio_pd_oen</description>
          <addressOffset>0x1a</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PD_OUT</name>
          <description>Auto-generated from gpio_pd_out</description>
          <addressOffset>0x1b</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PD_POL</name>
          <description>Auto-generated from gpio_pd_pol; aliases: GPIO_PD_SETTING2</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>GPIO_PD_DS</name>
          <description>Auto-generated from gpio_pd_ds</description>
          <addressOffset>0x1d</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PD_GPIO</name>
          <description>Auto-generated from gpio_pd_gpio</description>
          <addressOffset>0x1e</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PD_IRQ_EN</name>
          <description>Auto-generated from gpio_pd_irq_en</description>
          <addressOffset>0x1f</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PE_IN</name>
          <description>Auto-generated from gpio_pe_in</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PE_IE</name>
          <description>Auto-generated from gpio_pe_ie</description>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PE_OEN</name>
          <description>Auto-generated from gpio_pe_oen</description>
          <addressOffset>0x22</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PE_OUT</name>
          <description>Auto-generated from gpio_pe_out</description>
          <addressOffset>0x23</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PE_POL</name>
          <description>Auto-generated from gpio_pe_pol</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PE_DS</name>
          <description>Auto-generated from gpio_pe_ds</description>
          <addressOffset>0x25</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PE_GPIO</name>
          <description>Auto-generated from gpio_pe_gpio</description>
          <addressOffset>0x26</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_PE_IRQ_EN</name>
          <description>Auto-generated from gpio_pe_irq_en</description>
          <addressOffset>0x27</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>MUX_FUNC_A1</name>
          <description>Auto-generated from mux_func_a1</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>MUX_FUNC_A2</name>
          <description>Auto-generated from mux_func_a2</description>
          <addressOffset>0x29</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>MUX_FUNC_B1</name>
          <description>Auto-generated from mux_func_b1</description>
          <addressOffset>0x2a</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>MUX_FUNC_B2</name>
          <description>Auto-generated from mux_func_b2</description>
          <addressOffset>0x2b</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>MUX_FUNC_C1</name>
          <description>Auto-generated from mux_func_c1</description>
          <addressOffset>0x2c</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>MUX_FUNC_C2</name>
          <description>Auto-generated from mux_func_c2</description>
          <addressOffset>0x2d</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>MUX_FUNC_D1</name>
          <description>Auto-generated from mux_func_d1</description>
          <addressOffset>0x2e</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>MUX_FUNC_D2</name>
          <description>Auto-generated from mux_func_d2</description>
          <addressOffset>0x2f</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>GPIO_WAKEUP_IRQ</name>
          <description>Auto-generated from gpio_wakeup_irq</description>
          <addressOffset>0x35</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_GPIO_CORE_WAKEUP_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_GPIO_CORE_INTERRUPT_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN_I2C_SPI_OUT_EN</name>
          <description>Auto-generated from pin_i2c_spi_out_en</description>
          <addressOffset>0x36</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_PIN_PA3_SPI_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PIN_PA4_SPI_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PIN_PB6_SPI_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PIN_PD7_SPI_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PIN_PA3_I2C_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PIN_PAGROUP_SPI_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_PIN_PA4_I2C_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PIN_PB6_I2C_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PIN_PBGROUP_SPI_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PIN_PD7_I2C_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PIN_PDGROUP_SPI_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
