modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr8258.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSTEM_TIMER</name>
      <description>Auto-generated from section 'system timer'</description>
      <baseAddress>0x800740</baseAddress>
      <registers>
        <register>
          <name>SYSTEM_TICK</name>
          <description>Auto-generated from system_tick</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>SYSTEM_TICK_IRQ</name>
          <description>Auto-generated from system_tick_irq</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>SYSTEM_WAKEUP_TICK</name>
          <description>Auto-generated from system_wakeup_tick</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>SYSTEM_TICK_MODE</name>
          <description>Auto-generated from system_tick_mode</description>
          <addressOffset>0xc</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>SYSTEM_TICK_CTRL</name>
          <description>Auto-generated from system_tick_ctrl</description>
          <addressOffset>0xf</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_SYSTEM_TICK_START</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SYSTEM_TICK_IRQ_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SYSTEM_TICK_RUNNING</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SYSTEM_TICK_STOP</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWM</name>
      <description>Auto-generated from section 'pwm'</description>
      <baseAddress>0x800780</baseAddress>
      <registers>
        <register>
          <name>PWM_ENABLE</name>
          <description>Auto-generated from pwm_enable</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PWM0_ENABLE</name>
          <description>Auto-generated from pwm0_enable</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PWM_CLK</name>
          <description>Auto-generated from pwm_clk</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PWM0_MODE</name>
          <description>Auto-generated from pwm0_mode</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PWM_INVERT</name>
          <description>Auto-generated from pwm_invert</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PWM_N_INVERT</name>
          <description>Auto-generated from pwm_n_invert</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PWM_POL</name>
          <description>Auto-generated from pwm_pol</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_PWM_CMP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>FLD_PWM_MAX</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM0_PULSE_NUM</name>
          <description>Auto-generated from pwm0_pulse_num</description>
          <addressOffset>0x2c</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>PWM_IRQ_MASK</name>
          <description>Auto-generated from pwm_irq_mask</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PWM_IRQ_STA</name>
          <description>Auto-generated from pwm_irq_sta</description>
          <addressOffset>0x31</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_IRQ_PWM0_PNUM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_PWM0_IR_DMA_FIFO_DONE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_PWM0_FRAME</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_PWM1_FRAME</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_PWM2_FRAME</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_PWM3_FRAME</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_PWM4_FRAME</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_IRQ_PWM5_FRAME</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM0_FIFO_MODE_IRQ_MASK</name>
          <description>Auto-generated from pwm0_fifo_mode_irq_mask</description>
          <addressOffset>0x32</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_PWM0_IRQ_IR_FIFO_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM0_FIFO_MODE_IRQ_STA</name>
          <description>Auto-generated from pwm0_fifo_mode_irq_sta</description>
          <addressOffset>0x33</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_PWM0_IRQ_IR_FIFO_CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_IR_FIFO_IRQ_TRIG_LEVEL</name>
          <description>Auto-generated from pwm_ir_fifo_irq_trig_level</description>
          <addressOffset>0x4c</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PWM_IR_FIFO_DATA_STATUS</name>
          <description>Auto-generated from pwm_ir_fifo_data_status</description>
          <addressOffset>0x4d</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_PWM0_IR_FIFO_DATA_NUM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_PWM0_IR_FIFO_EMPTY</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PWM0_IR_FIFO_FULL</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_IR_CLR_FIFO_DATA</name>
          <description>Auto-generated from pwm_ir_clr_fifo_data</description>
          <addressOffset>0x4e</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_PWM0_IR_FIFO_CLR_DATA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
