modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr8258.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FIFO</name>
      <description>Auto-generated from section 'fifo'</description>
      <baseAddress>0x800800</baseAddress>
      <registers>
        <register>
          <name>FIFO0_DATA</name>
          <description>Auto-generated from fifo0_data</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FIFO1_DATA</name>
          <description>Auto-generated from fifo1_data</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FIFO2_DATA</name>
          <description>Auto-generated from fifo2_data</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DFIFO</name>
      <description>Auto-generated from section 'dfifo'</description>
      <baseAddress>0x800b00</baseAddress>
      <registers>
        <register>
          <name>DFIFO0_ADDR</name>
          <description>Auto-generated from dfifo0_addr</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO0_SIZE</name>
          <description>Auto-generated from dfifo0_size</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DFIFO1_ADDR</name>
          <description>Auto-generated from dfifo1_addr</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO1_SIZE</name>
          <description>Auto-generated from dfifo1_size</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DFIFO2_ADDR</name>
          <description>Auto-generated from dfifo2_addr</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO2_SIZE</name>
          <description>Auto-generated from dfifo2_size</description>
          <addressOffset>0xa</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DFIFO_MODE</name>
          <description>Auto-generated from dfifo_mode</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AUD_DFIFO0_IN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO1_IN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO2_IN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO0_OUT</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO0_L_INT</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO0_H_INT</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO1_H_INT</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO2_H_INT</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIFO_AIN</name>
          <description>Auto-generated from dfifo_ain</description>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AUD_DMIC0_DATA_IN_RISING_EDGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DMIC1_DATA_IN_RISING_EDGE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_INPUT_SELECT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_INPUT_MONO_MODE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DECIMATION_FILTER_BYPASS</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DMIC_RISING_EDGE_BYPASS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DMIC_FALLING_EDGE_BYPASS</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIFO_DEC_RATIO</name>
          <description>Auto-generated from dfifo_dec_ratio</description>
          <addressOffset>0x12</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DFIFO_IRQ_STATUS</name>
          <description>Auto-generated from dfifo_irq_status</description>
          <addressOffset>0x13</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AUD_DFIFO0_L_IRQ</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO0_H_IRQ</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO1_L_IRQ</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO1_H_IRQ</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIFO0_RPTR</name>
          <description>Auto-generated from dfifo0_rptr</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO0_WPTR</name>
          <description>Auto-generated from dfifo0_wptr</description>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO1_RPTR</name>
          <description>Auto-generated from dfifo1_rptr</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO1_WPTR</name>
          <description>Auto-generated from dfifo1_wptr</description>
          <addressOffset>0x1a</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO2_RPTR</name>
          <description>Auto-generated from dfifo2_rptr</description>
          <addressOffset>0x1c</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO2_WPTR</name>
          <description>Auto-generated from dfifo2_wptr</description>
          <addressOffset>0x1e</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO0_NUM</name>
          <description>Auto-generated from dfifo0_num</description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO1_NUM</name>
          <description>Auto-generated from dfifo1_num</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO2_NUM</name>
          <description>Auto-generated from dfifo2_num</description>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO0_MANUAL</name>
          <description>Auto-generated from dfifo0_manual</description>
          <addressOffset>0x2c</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_DFIFO_MANUAL_MODE_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIFO0_MAN_DAT</name>
          <description>Auto-generated from dfifo0_man_dat</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>ALC_SFT</name>
          <description>Auto-generated from alc_sft</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AUDIO_DEC_MODE</name>
          <description>Auto-generated from audio_dec_mode</description>
          <addressOffset>0x35</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AUD_LNR_VALID_SEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_CIC_MODE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_MUL</name>
          <description>Auto-generated from adc_mul</description>
          <addressOffset>0x36</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ADC_BIAS</name>
          <description>Auto-generated from adc_bias</description>
          <addressOffset>0x37</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>AUD_ALC_HPF_LPF_CTRL</name>
          <description>Auto-generated from aud_alc_hpf_lpf_ctrl</description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AUD_ALC_MIN_PGA_IN_ANALOG_MODE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_ALC_MIN_VOLUME_IN_DIGITAL_MODE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_IN_HPF_SFT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_IN_HPF_BYPASS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_IN_ALC_BYPASS</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_IN_LPF_BYPASS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_ALC_DIGITAL_MODE_AUTO_REGULATE_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DOUBLE_DOWN_SAMPLING_ON</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALC_VOL_H</name>
          <description>Auto-generated from alc_vol_h</description>
          <addressOffset>0x43</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AUD_ALC_MAX_PGA_IN_ANALOG_MODE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_ALC_MAX_VOLUME_IN_DIGITAL_MODE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALC_VOL_TH_H</name>
          <description>Auto-generated from alc_vol_th_h</description>
          <addressOffset>0x44</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>ALC_VOL_TH_L</name>
          <description>Auto-generated from alc_vol_th_l</description>
          <addressOffset>0x46</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>ALC_VOL_TH_N</name>
          <description>Auto-generated from alc_vol_th_n</description>
          <addressOffset>0x48</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>ALC_VAD_TH_N</name>
          <description>Auto-generated from alc_vad_th_n</description>
          <addressOffset>0x4a</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>ALC_VOL_STEP</name>
          <description>Auto-generated from alc_vol_step</description>
          <addressOffset>0x4c</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ALC_VOL_L</name>
          <description>Auto-generated from alc_vol_l</description>
          <addressOffset>0x4d</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ALC_VOL_R</name>
          <description>Auto-generated from alc_vol_r</description>
          <addressOffset>0x4e</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ALC_PEAK_TICK</name>
          <description>Auto-generated from alc_peak_tick</description>
          <addressOffset>0x50</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>ALC_DEC_TICK</name>
          <description>Auto-generated from alc_dec_tick</description>
          <addressOffset>0x52</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ALC_NOI_TICK</name>
          <description>Auto-generated from alc_noi_tick</description>
          <addressOffset>0x53</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AUD_ALC_ANALOG_MODE_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_ALC_NOISE_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALC_COEF_IIR</name>
          <description>Auto-generated from alc_coef_iir</description>
          <addressOffset>0x55</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ALC_DAT_MASK</name>
          <description>Auto-generated from alc_dat_mask</description>
          <addressOffset>0x56</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ALC_INC_SPD</name>
          <description>Auto-generated from alc_inc_spd</description>
          <addressOffset>0x57</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ALC_INC_MAX</name>
          <description>Auto-generated from alc_inc_max</description>
          <addressOffset>0x58</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ALC_DEC_SPD</name>
          <description>Auto-generated from alc_dec_spd</description>
          <addressOffset>0x59</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ALC_DEC_MAX</name>
          <description>Auto-generated from alc_dec_max</description>
          <addressOffset>0x5a</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ALC_NOI_SPD</name>
          <description>Auto-generated from alc_noi_spd</description>
          <addressOffset>0x5b</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ALC_NOI_MAX</name>
          <description>Auto-generated from alc_noi_max</description>
          <addressOffset>0x5c</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PGA_GAIN_INIT</name>
          <description>Auto-generated from pga_gain_init</description>
          <addressOffset>0x5d</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PGA_MAN_SPEED</name>
          <description>Auto-generated from pga_man_speed</description>
          <addressOffset>0x60</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PGA_MAN_TARGET_L</name>
          <description>Auto-generated from pga_man_target_l</description>
          <addressOffset>0x61</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PGA_VALUE_L</name>
          <description>Auto-generated from pga_value_l</description>
          <addressOffset>0x62</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PGA_FIX_VALUE</name>
          <description>Auto-generated from pga_fix_value</description>
          <addressOffset>0x63</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_PGA_POST_AMPLIFIER_GAIN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>FLD_PGA_PRE_AMPLIFIER_GAIN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PGA_GAIN_FIX_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PGA_R_L</name>
          <description>Auto-generated from pga_r_l</description>
          <addressOffset>0x64</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PGA_MAN_TARGET_R</name>
          <description>Auto-generated from pga_man_target_r</description>
          <addressOffset>0x65</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PGA_VALUE_R</name>
          <description>Auto-generated from pga_value_r</description>
          <addressOffset>0x66</addressOffset>
          <size>8</size>
        </register>
