modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr8258.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>Auto-generated from section 'dma'</description>
      <baseAddress>0x800c00</baseAddress>
      <registers>
        <register>
          <name>DMA0_ADDR</name>
          <description>Auto-generated from dma0_addr</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA0_SIZE</name>
          <description>Auto-generated from dma0_size</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA0_MODE</name>
          <description>Auto-generated from dma0_mode</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_DMA_WR_MEM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_PINGPONG_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_FIFO_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_AUTO_MODE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_READ_MODE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_BYTE_MODE</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1_ADDR</name>
          <description>Auto-generated from dma1_addr</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA1_SIZE</name>
          <description>Auto-generated from dma1_size</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA1_MODE</name>
          <description>Auto-generated from dma1_mode</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA2_ADDR</name>
          <description>Auto-generated from dma2_addr</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA2_SIZE</name>
          <description>Auto-generated from dma2_size</description>
          <addressOffset>0xa</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA2_MODE</name>
          <description>Auto-generated from dma2_mode</description>
          <addressOffset>0xb</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA3_ADDR</name>
          <description>Auto-generated from dma3_addr</description>
          <addressOffset>0xc</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA3_SIZE</name>
          <description>Auto-generated from dma3_size</description>
          <addressOffset>0xe</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA3_MODE</name>
          <description>Auto-generated from dma3_mode</description>
          <addressOffset>0xf</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA4_ADDR</name>
          <description>Auto-generated from dma4_addr</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA4_SIZE</name>
          <description>Auto-generated from dma4_size</description>
          <addressOffset>0x12</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA4_MODE</name>
          <description>Auto-generated from dma4_mode</description>
          <addressOffset>0x13</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA5_ADDR</name>
          <description>Auto-generated from dma5_addr</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA5_SIZE</name>
          <description>Auto-generated from dma5_size</description>
          <addressOffset>0x16</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA5_MODE</name>
          <description>Auto-generated from dma5_mode</description>
          <addressOffset>0x17</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA7_ADDR</name>
          <description>Auto-generated from dma7_addr</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA7_SIZE</name>
          <description>Auto-generated from dma7_size</description>
          <addressOffset>0x1a</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA7_MODE</name>
          <description>Auto-generated from dma7_mode</description>
          <addressOffset>0x1b</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_T_ADDR</name>
          <description>Auto-generated from dma_t_addr</description>
          <addressOffset>0x1c</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DMA_T_SIZE</name>
          <description>Auto-generated from dma_t_size</description>
          <addressOffset>0x1e</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_CHN_EN</name>
          <description>Auto-generated from dma_chn_en</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_CHN_IRQ_MSK</name>
          <description>Auto-generated from dma_chn_irq_msk</description>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_TX_RDY0</name>
          <description>Auto-generated from dma_tx_rdy0</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_TX_RDY1</name>
          <description>Auto-generated from dma_tx_rdy1</description>
          <addressOffset>0x25</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_RX_RDY0</name>
          <description>Auto-generated from dma_rx_rdy0</description>
          <addressOffset>0x26</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_RX_RDY1</name>
          <description>Auto-generated from dma_rx_rdy1</description>
          <addressOffset>0x27</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_DMA_CHN0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN_UART_RX</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN_UART_TX</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN_RF_RX</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN_RF_TX</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN4</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN_AES_OUT</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN5</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN_AES_IN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN7</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_CHN_PWM</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RX_RPTR</name>
          <description>Auto-generated from dma_rx_rptr</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_RX_WPTR</name>
          <description>Auto-generated from dma_rx_wptr</description>
          <addressOffset>0x29</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_TX_RPTR</name>
          <description>Auto-generated from dma_tx_rptr</description>
          <addressOffset>0x2a</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_TX_WPTR</name>
          <description>Auto-generated from dma_tx_wptr</description>
          <addressOffset>0x2b</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_TX_FIFO</name>
          <description>Auto-generated from dma_tx_fifo</description>
          <addressOffset>0x2c</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>FLD_DMA_RPTR_CLR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_RPTR_NEXT</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DMA_RPTR_SET</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0_ADDRHI</name>
          <description>Auto-generated from dma0_addrhi</description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA1_ADDRHI</name>
          <description>Auto-generated from dma1_addrhi</description>
          <addressOffset>0x41</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA2_ADDRHI</name>
          <description>Auto-generated from dma2_addrhi</description>
          <addressOffset>0x42</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA3_ADDRHI</name>
          <description>Auto-generated from dma3_addrhi</description>
          <addressOffset>0x43</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA4_ADDRHI</name>
          <description>Auto-generated from dma4_addrhi</description>
          <addressOffset>0x44</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA5_ADDRHI</name>
          <description>Auto-generated from dma5_addrhi</description>
          <addressOffset>0x45</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_TA_ADDRHI</name>
          <description>Auto-generated from dma_ta_addrhi</description>
          <addressOffset>0x46</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA_A3_ADDRHI</name>
          <description>Auto-generated from dma_a3_addrhi</description>
          <addressOffset>0x47</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DMA7_ADDRHI</name>
          <description>Auto-generated from dma7_addrhi</description>
          <addressOffset>0x48</addressOffset>
          <size>8</size>
        </register>
