modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr8258.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LINKLAYER</name>
      <description>Auto-generated from section 'linklayer'</description>
      <baseAddress>0x800f02</baseAddress>
      <registers>
        <register>
          <name>RF_LL_CTRL_0</name>
          <description>Auto-generated from rf_ll_ctrl_0</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>RF_LL_CTRL_1</name>
          <description>Auto-generated from rf_ll_ctrl_1</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RF_FSM_TIMEOUT_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_FIRST_TIMEOUT_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_RX_TIMEOUT_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_CRC_2_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_BRX_SN_INIT</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_BRX_NESN_INIT</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_BTX_SN_INIT</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_BTX_NESN_INIT</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_RX_TIMEOUT</name>
          <description>Auto-generated from rf_rx_timeout</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>RF_LL_CTRL_2</name>
          <description>Auto-generated from rf_ll_ctrl_2</description>
          <addressOffset>0x13</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>RF_LL_CTRL_3</name>
          <description>Auto-generated from rf_ll_ctrl_3</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_RF_TX_EN_DLY_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_PLL_RST_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_CMD_SCHEDULE_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_R_TX_EN_DLY</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_IRQ_MASK</name>
          <description>Auto-generated from rf_irq_mask</description>
          <addressOffset>0x1a</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>RF_IRQ_STATUS</name>
          <description>Auto-generated from rf_irq_status</description>
          <addressOffset>0x1e</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>RF_FSM_TIMEOUT</name>
          <description>Auto-generated from rf_fsm_timeout</description>
          <addressOffset>0x2a</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLD_RF_IRQ_RX</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_TX_PA_PWR_H</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>FLD_XO_CDAC_ANA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_TX</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_RX_TIMEOUT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_DCCC_DOUBLER_POWER_DOWN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_48M_TO_RX_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_PLL_BG_POWER_DOWN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_RX_CRC_2</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_48M_TO_DIG_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_CMD_DONE</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_TX_MI_SEL</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_24M_TO_SAR_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_FSM_TIMEOUT</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RX_MI_SEL</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_XO_MODE_ANA</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_CLK_48M_TO_CAL_DIG_MAN_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_RETRY_HIT</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_XO_CAP_OFF_ANA</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_TX_DS</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_RX_DR</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_FIRST_TIMEOUT</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_INVALID_PID</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_RF_IRQ_STX_TIMEOUT</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
